///////////////////////////////////////////////////////////////////////////////
//                      FAT12/FAT16/FAT32 FileSystem
//
//                  ROM:12K, SRAM:3K (측정일 2022-05-14)
//
// 2022-03-17 한글 파일명 처리
// 2022-04-23 SUPPORT_UTF8==0 으로 하면 토탈커멘더로 ImageDisk에 넣은 LFN인식
// 2022-05-13 LFN 파일 생성
//
// 제약: 파일을 삭제할 때 파일명 문자수가 194(13*15)보다 크면 일부 LFN 엔트리가 삭제되지 않음
//       FAT12에서는 읽기만 지원함
///////////////////////////////////////////////////////////////////////////////

#include "JLIB.H"
#ifndef _WIN32
#include "DRIVER.H"
#include "JOS.H"
#endif
#include "MAIN.H"
#include "JFAT.H"
#include "MONITOR.H"


#define MEMOWNER_FindFirstFile  (MEMOWNER_JFAT+0)
#define MEMOWNER_JFAT_MakeLfn   (MEMOWNER_JFAT+1)


typedef struct _DIRENTRY
    {
    BYTE FileName[11];
    BYTE FileAttr;      //0B
    BYTE LfnType;       //0C 83엔트리에서는 NT Resource (보통0)
    BYTE LfnChkSum;     //0D 83엔트리에서는 Create Time Tenth (보통0)
    WORD CreateTime;    //0E Win95에서 추가
    WORD CreateDate;    //10 Win95에서 추가
    WORD AccessDate;    //12 Win95에서 추가
    WORD ClusterNoHi;   //14 Win95 OSR2에서 추가 (FAT32)
    WORD LastModiTime;  //16
    WORD LastModiDate;  //18
    WORD StartCluster;  //1A
    DWORD FileSize;     //1C
    } DIRENTRY;         //20

//DIRENTRY.파일명 첫자의 의미
#define DIRENTRY_END    0
#define DIRENTRY_ERASE  0xE5


#define FILE_ATTRIBUTE_LFN  (FILE_ATTRIBUTE_READONLY|FILE_ATTRIBUTE_HIDDEN|FILE_ATTRIBUTE_SYSTEM|FILE_ATTRIBUTE_VOLUME)


//AccessStorageBytes()의 Access 인자
#define DEVICE_READ     0
#define DEVICE_WRITE    1


#define FAT12_MAXQTY    0xFF5           //4085
#define FAT12_BAD       0xFF7
#define FAT12_EOF       0xFF8           //~0FFFh
#define FAT16_MAXQTY    0xFFF5          //65525
#define FAT16_BAD       0xFFF7
#define FAT16_EOF       0xFFF8          //~0FFFFh
#define FAT32_BAD       0xFFFFFF7
#define FAT32_EOF       0xFFFFFF8       //~0FFFFFFFh

#define FILEOPENSIGN    0xA5

typedef struct _DISKCONTROLBLOCK
    {
    BYTE  FatType;              //12 or 16 or 32
    BYTE  Lun;
    UINT  RootDirSctQty;
    DWORD VolumeStartSctNo;
    DWORD RootClustNo;
    DWORD FirstFatSctNo;
    DWORD SecondFatSctNo;
    DWORD ClusterStartSctNo;
    DWORD SctsPerCluster;
    DWORD RootDirSctNo;
    DWORD TotalClusters;
    DWORD DiskSectorQty;        //디스크의 총 섹터수
    DWORD LastFreeClustNo;
    DWORD BPB_LastFreeClustNo;  //ReadVolID()에서 BPB에 저장된 기록할 위치
    BYTE  FatCacheDirtyFg;      //실제 Disk 내용과 Cache 내용이 다른 경우
    DWORD FatCachedSctNo;       //-1이면 캐쉬되지 않은 것임
    #ifdef USE_JOS
    JOS_EVENT* DCB_Sem;
    #endif
    BYTE  FatCacheBuff[SUPPORTSECTORBYTES] ALIGN_END;   //DMA 전송시 버퍼의 시작번지는 4로 나누어져야 함
    BYTE  SctBuffer[SUPPORTSECTORBYTES];
    } DISKCONTROLBLOCK;

static DISKCONTROLBLOCK DiskControlBlock[SUPPORTDISKMAX];


typedef struct _FILECONTROLBLOCK
    {
    BYTE  FileOpened;           //1이면 Open되어 있는 것임
    //BYTE  FileAttr;
    BYTE  OpenMode;
    DWORD StartCluster;         //0인 경우는 파일크기가 0일 때임
    DWORD AccCluster;           //현재 파일 포인터가 위치한 클러스터
    DWORD PrevAccCluster;       //기록할 때 AccCluster==Eof 인경우 클러스트를 추가할당하여 연결할 때 필요
    DWORD FilePointer;
    DWORD FileSize;
    DWORD DESctNo, DESctOfs;    //파일을 생성한 경우 크기를 변경해야 하므로 DE의 위치를 보관함
    DISKCONTROLBLOCK *Dcb;
    } FILECONTROLBLOCK;

static FILECONTROLBLOCK FileCtrlBlock[OPENFILEQTY];



#ifdef _WIN32
#pragma pack(push,1)
#endif

//-----------------------------------------------------------------------------
//              FAT16 Boot Record (BiosPrmBlock)
//-----------------------------------------------------------------------------
typedef struct _BPB_F16
    {
    BYTE JumpStartBoot[3];      //00
    BYTE BootOsSign[8];         //03 'MSWIN4.0'
    WORD BytesPerSector;        //0B 512
    BYTE SectorsPerCluster;     //0D 64
    WORD SystemUseSctNo;        //0E 1  - 시스템이 사용하는 섹터수, FAT의 시작을 가리킴
    BYTE FATCopys;              //10 2  - FAT수
    WORD RootDirEntrys;         //11 512 - 최대 메인 디렉터리 파일수
    WORD OldTotalSectors;       //13 0  - 디스크의 총 섹터 (0=사용안함)
    BYTE MediaSign;             //15 0F8h  - 메디아종류
    WORD SectorsPerFAT;         //16 192
    WORD SectorsPerHead;        //18 63
    WORD HeadQty;               //1A 128
    DWORD StartRtvSctNo;        //1C 63 - 이 드라이브의 시작 섹터번호(하드디스크 전체를 기준, 처음은 0), 이 부트레코드를 가리킴
    DWORD BigTotalSectors;      //20 3144897 - 이 드라이브의 총섹터수 (이 부트섹터부터 ...)
    BYTE PhyDiskNo;             //24 80h  - 물리적인 드라이브 번호
    BYTE Unknown1;              //25 0
    BYTE ExtBootSign;           //26 29h - 확장 부트레코더 사인
    DWORD SerialNo;             //27 0C210FF5h
    CHAR VolumeLabel[11];       //2B 'No Name    '
    CHAR FileSystemSign[8];     //36 'FAT16   '
    BYTE BootProcCode[448];     //3E
    WORD BootSctValidSign;      //1FE 0AA55h
    }PACK_STRUCT BPB_F16;



//------------------------------------------------------------------------------
//              FAT32 Boot Record (BiosPrmBlock)
//------------------------------------------------------------------------------
typedef struct _BPB_F32
    {
    BYTE JumpStartBoot[3];      //00
    BYTE BootOsSign[8];         //03 'MSWIN4.0'
    WORD BytesPerSector;        //0B 512
    BYTE SectorsPerCluster;     //0D 64
    WORD SystemUseSctNo;        //0E 1  - 시스템이 사용하는 섹터수, FAT의 시작을 가리킴
    BYTE FATCopys;              //10 2  - FAT수
    WORD RootDirEntrys;         //11 0 - 최대 메인 디렉터리 파일수 (FAT32에서는 사용안함)
    WORD OldTotalSectors;       //13 0  - 디스크의 총 섹터 (0=사용안함)
    BYTE MediaSign;             //15 0F8h  - 메디아종류
    WORD SectorsPerFAT;         //16 0 (FAT32에서는 사용안함)
    WORD SectorsPerHead;        //18 63
    WORD HeadQty;               //1A 128
    DWORD StartRtvSctNo;        //1C 63 - 이 드라이브의 시작 섹터번호(하드디스크 전체를 기준, 처음은 0), 이 부트레코드를 가리킴
    DWORD BigTotalSectors;      //20 3144897 - 이 드라이브의 총섹터수 (이 부트섹터부터 ...)
    //여기부터는 FAT16과 완전히 다름
    DWORD BigSctPerFAT;         //24 6475
    BYTE ActiveFATNo;           //28 0 (0-15) - BPB구조에서는 아래와 WORD로 BPB_ExtFlags로 명시
    BYTE ExtFlagsHigh;          //29 0
    WORD FS_Version;            //2A 0 - 이 값이 0이 아니면 오류처리
    DWORD RootDirClustNo;       //2C 2
    WORD FSInfoSctQty;          //30 1
    WORD BkUpBootSctOfs;        //32 6
    DWORD Reserved4;            //34 0
    DWORD Reserved5;            //38 0
    DWORD Reserved6;            //3C 0
    //FAT16에도 있었지만 위치가 바뀜
    BYTE FS32PhyDiskNo;         //40 80h - 물리적인 드라이브 번호
    BYTE FS32Unknown1;          //41 0
    BYTE FS32ExtBootSign;       //42 29h - 확장 부트레코더 사인
    DWORD FS32SerialNo;         //43 37231BF5h
    CHAR FS32VolumeLabel[11];   //47 'No Name    '
    CHAR FS32Sign[8];           //52 'FAT32   '
    BYTE FS32BootCode[420];     //5A
    WORD BootSctValidSign;      //1FE 0AA55h
    }PACK_STRUCT BPB_F32;


#ifdef _WIN32
#pragma pack()
#endif





//-----------------------------------------------------------------------------
//      DosFileTime 형식으로 리턴
//-----------------------------------------------------------------------------
LOCAL(DWORD) SystemTimeToDosFileTime(CONST SYSTEMTIME *ST)
    {
    return ST->wYear<1980 ? 0x00210000:
           ((DWORD)(ST->wYear-1980)<<25)|((DWORD)ST->wMonth<<21)|((DWORD)ST->wDay<<16)|
           ((DWORD)ST->wHour<<11)|((DWORD)ST->wMinute<<5)|((DWORD)ST->wSecond>>1);
    }




//-----------------------------------------------------------------------------
//      JTIME시간을 DosFileTime으로 변환
//-----------------------------------------------------------------------------
LOCAL(DWORD) JTimeToDosDateTime(JTIME JTime)
    {
    SYSTEMTIME ST;

    UnpackTotalSecond(&ST, JTime);
